Информационная_база/src/DataProcessors/ОбщиеЧаты/ОбщиеЧаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбщиеЧаты</name>
</mdclass:DataProcessor>

Информационная_база/src/InformationRegisters/РегистрСведенийЧата/РегистрСведенийЧата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрСведенийЧата</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>СообщениеПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительОбщийЧат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВремяОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база/src/DataProcessors/ОбщиеЧаты/Forms/Форма/Module.bsl
&НаСервере
Функция ОтпрвитьСообщениеКомандаНаСервере(ТекстСообщения)
	НоваяЗапись = РегистрыСведений.РегистрСведенийЧата.СоздатьМенеджерЗаписи();
	НоваяЗапись.ВремяОтправления = ТекущаяДата();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.СообщениеПользователя = ИмяПользователя() + Символы.ПС + ТекстСообщения +  Символы.ПС + Формат(ТекущаяДата(), "ДЛФ=в");
	НоваяЗапись.ОтправительОбщийЧат = ИмяПользователя();
	НоваяЗапись.Записать();

	
КонецФункции

&НаКлиенте
Процедура ОтпрвитьСообщениеКоманда(Команда)
	ТекстСообщения = Элементы.СообщениеПользователя.ТекстРедактирования;
	ФункцияСсылка = ОтпрвитьСообщениеКомандаНаСервере(ТекстСообщения);
	Сообщение = "";
	Элементы.ЧатОбщий.Обновить();

	
	
		//НавигационаяСсылка = НавСсылка;
		ПоказатьОповещениеПользователя("Новое сообщение в общем чате: " 
		,
		,ТекстСообщения
		,БиблиотекаКартинок.Информация
		,СтатусОповещенияПользователя.Важное
		,Новый УникальныйИдентификатор);
КонецПроцедуры
